# Тестування API за допомогою JMeter

## Опис тесту
Тест планується для перевірки API на основі HTTP-запитів. Для тесту використовуються наступні типи запитів:
- GET-запит для перевірки наявності ресурсу.
- POST-запит для перевірки додавання нових даних.
- Перевірка коду відповіді
- Перевірка заголовків
- Перевірка тіла відповіді
- Перевірка розміру файлу.

## Кроки виконання тесту:
1. Додавання ассертів до GET-запиту
Response Assertion:Перевірка, що код відповіді є 200, що вказує на успішне виконання запиту.
JSON Assertion: Перевірка,що поле "id" містить правильне значення=1.
Text Response: Перевірка значень полів у тілі JSON відповідь містить значеня "1"
2. Додавання ассертів до POST-запиту
Response Assertion:Перевірка, що код відповіді є Created, що вказує на успішне виконання запиту.
JSON Assertion: Перевірка значень полів у тілі JSON відповіді"Rosr".
Size Assertion: Перевірка, що розмір відповіді більший ніж 50 байт.
3. Зберегти тест у форматі `.jmx`.
4. Перевірити результати через "View Results Tree".

## Результати тесту
- **GET-запит:** Статус код 200 OK.
- **POST-запит:** Дані успішно додано.
- **Розмір відповіді:** Більше 50 байт.
- **JSON-поля:** Відповідають очікуваним значенням.

## Висновки
 Всі запити виконались без помилок.